In [1]:
import pandas as pd
import numpy as np

In [78]:
movies = pd.read_csv('movies.csv')
ratings = pd.read_csv('ratings.csv')

display(movies.head())
display(ratings.head())

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

   userId  movieId  rating  timestamp
0       1        1     5.0  847117005
1       1        2     3.0  847642142
2       1       10     3.0  847641896
3       1       32     4.0  847642008
4       1       34     4.0  847641956

In [79]:
#drop timestamp at ratings df
ratings.drop('timestamp', axis=1, inplace=True)

In [80]:
display(movies.head())
display(ratings.head())

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

   userId  movieId  rating
0       1        1     5.0
1       1        2     3.0
2       1       10     3.0
3       1       32     4.0
4       1       34     4.0

In [81]:
df = pd.merge(movies[['movieId', 'title']], ratings, on='movieId')
df.head()

   movieId             title  userId  rating
0        1  Toy Story (1995)       1     5.0
1        1  Toy Story (1995)       2     3.0
2        1  Toy Story (1995)       5     4.0
3        1  Toy Story (1995)       6     4.0
4        1  Toy Story (1995)       8     3.0

In [82]:
df_count = df.groupby('title')['rating'].count().reset_index()
df_count.rename(columns={'rating':'totalRating'}, inplace =True)
df_count.head()

                              title  totalRating
0  "Great Performances" Cats (1998)            2
1                        '71 (2014)            2
2            'Round Midnight (1986)            1
3         'Til There Was You (1997)            2
4                'burbs, The (1989)           18

In [83]:
df = pd.merge(df, df_count, on='title')
df.head()

   movieId             title  userId  rating  totalRating
0        1  Toy Story (1995)       1     5.0          263
1        1  Toy Story (1995)       2     3.0          263
2        1  Toy Story (1995)       5     4.0          263
3        1  Toy Story (1995)       6     4.0          263
4        1  Toy Story (1995)       8     3.0          263

In [164]:
pivot_df = df.pivot_table(index='title',columns='userId',values='rating').fillna(0)
pivot_df.head()

userId,1,2,3,4,5,6,7,8,9,10,...,709,710,711,712,713,714,715,716,717,718
title,,,,,,,,,,,,,,,,,,,,,
"""Great Performances"" Cats (1998)",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
'71 (2014),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
'Round Midnight (1986),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
'Til There Was You (1997),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
"'burbs, The (1989)",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.0,0.0,0.0,0.0,0.0,0.0,0.0

In [165]:
features_df = pd.merge(pivot_df, movies[['title', 'genres']], on='title')
features_df.head()

,title,1,2,3,4,5,6,7,8,9,...,710,711,712,713,714,715,716,717,718,genres
0,"""Great Performances"" Cats (1998)",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Musical
1,'71 (2014),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Action|Drama|Thriller|War
2,'Round Midnight (1986),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Drama|Musical
3,'Til There Was You (1997),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,Drama|Romance
4,"'burbs, The (1989)",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,3.0,0.0,0.0,0.0,0.0,0.0,0.0,Comedy

In [87]:
features_df['genres'] = features_df.genres.str.split('|')

#onehot encoding genre at features_df df
features_df.genres.apply(set)
for genres in set.union(*features_df.genres.apply(set)):
    features_df[genres] = features_df.apply(lambda x: int(x.genres.count(genre)), axis=1)
features_df.drop('genres', axis=1, inplace=True)
features_df.head()

,title,1,2,3,4,5,6,7,8,9,...,Western,Mystery,Romance,Crime,Fantasy,Adventure,Drama,Thriller,Animation,Musical
0,"""Great Performances"" Cats (1998)",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0
1,'71 (2014),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0
2,'Round Midnight (1986),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0
3,'Til There Was You (1997),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,1,1,1,1,1,1,1,1,1,1
4,"'burbs, The (1989)",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0

In [172]:
dataset = features_df.set_index('title').T.to_dict('list')

,title,1,2,3,4,5,6,7,8,9,...,709,710,711,712,713,714,715,716,717,718
0,"""Great Performances"" Cats (1998)",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,'71 (2014),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,'Round Midnight (1986),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,'Til There Was You (1997),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,"'burbs, The (1989)",0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.0,0.0,0.0,0.0,0.0,0.0,0.0

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: UserWarning: DataFrame columns are not unique, some columns will be omitted.
  This is separate from the ipykernel package so we can avoid doing imports until

![Eucladian Distance](https://wikimedia.org/api/rest_v1/media/math/render/svg/795b967db2917cdde7c2da2d1ee327eb673276c0)

In [168]:
def distance(point_p, point_q):
    #Calculate distance using Eucladian distance
    squared_difference = 0
    #calculate squared_difference between point from 1 to n
    for i in range(len(point_p)):
        squared_difference += (point_p[i] - point_q[i]) ** 2
    final_distance = squared_difference ** 0.5
    return final_distance

In [169]:
def classify(title, dataset, k):
    distances = []
    title_feature = dataset[title]
    #Looping through all points in the dataset
    for data in dataset:
        point = dataset[data]
        distance_to_point = distance(title_feature, point)
        #Adding the distance and point associated with that distance
        distances.append([distance_to_point, data])
    distances.sort()
    #Taking only the k closest points
    neighbors = distances[0:k+1]
    return neighbors

In [161]:
title = "Avengers, The (2012)"
make_recomendation = classify(title, dataset, 10)
for i in range(0, len(make_recomendation)):
    if i == 0:
        print('Recommendations for {0}:\n'.format(make_recomendation[0][1]))
    else:
        print('{0}: {1}, with distance of: {2}'.format(i, make_recomendation[i][1], make_recomendation[i][0]))

Recommendations for Avengers, The (2012):

1: Dark Knight Rises, The (2012), with distance of: 18.425525772688278
2: Iron Man 3 (2013), with distance of: 18.694919095839918
3: Super 8 (2011), with distance of: 18.78163997099295
4: Mission: Impossible - Ghost Protocol (2011), with distance of: 19.300259065618782
5: Star Trek Into Darkness (2013), with distance of: 19.5
6: Hunger Games, The (2012), with distance of: 19.512816301087856
7: Captain America: The Winter Soldier (2014), with distance of: 19.519221295943137
8: Hunger Games: Catching Fire, The (2013), with distance of: 19.849433241279208
9: Perks of Being a Wallflower, The (2012), with distance of: 20.024984394500787
10: X-Men: First Class (2011), with distance of: 20.09975124224178